INSERT INTO posts (post_name, payment) VALUES
    ('Менеджер - HR', 60000),
    ('Разработчик', 70000),
    ('Аналитик', 60000),
    ('Тестировщик', 50000),
    ('Стажёр', 20000);

INSERT INTO Employees (name, Address, post_id, experience, birth_date, education) VALUES
    ('Иван Иванов', 'ул. Ленина, 1', 1, 9, '1990-05-15', 'Высшее'),
    ('Петр Петров', 'ул. Советская, 2', 2, 8, '1992-07-20', 'Среднее специальное'),
    ('Сергей Сергеев', 'ул. Победы, 3', 3, 8, '1988-03-10', 'Высшее'),
    ('Анна Смирнова', 'ул. Мира, 4', 4, 2, '1965-12-15', 'Высшее'),
    ('Елизаветта Снигирева', 'ул. Ленина, 4', 5, 0, '2000-10-23', 'Два высших'),
    ('Анастасия Нелюбина', 'ул. Сокола, 4', 2, 1, '2001-01-12', 'Высшее');

INSERT INTO Employees_posts (Employee_id, post_id, start_date, end_date) VALUES
    (1, 5, '2016-01-01', '2018-07-01'),
    (1, 2, '2018-07-01', '2020-04-02'),
    (1, 1, '2020-04-02', NULL),

    (2, 5, '2017-06-01', '2019-03-01'),
    (2, 2, '2019-03-01', NULL),

    (3, 3, '2017-07-11', NULL),

    (4, 4, '2023-01-01', NULL),

    (5, 5, '2024-07-21', NULL),

    (6, 5, '2023-06-11', '2024-01-01'),
    (6, 2, '2024-01-01', NULL);


-- Иван Иванов: 60000 (база) + 5000 (опыт) = 65000
-- Иван НЕ участвует в projects_roles
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
      -- 2023
      (1, 65000, 'зарплата', '2023-01-31'), (1, 65000, 'зарплата', '2023-02-28'), (1, 65000, 'зарплата', '2023-03-31'),
      (1, 65000, 'зарплата', '2023-04-30'), (1, 65000, 'зарплата', '2023-05-31'), (1, 65000, 'зарплата', '2023-06-30'),
      (1, 65000, 'зарплата', '2023-07-31'), (1, 65000, 'зарплата', '2023-08-31'), (1, 65000, 'зарплата', '2023-09-30'),
      (1, 65000, 'зарплата', '2023-10-31'), (1, 65000, 'зарплата', '2023-11-30'), (1, 65000, 'зарплата', '2023-12-31'),
      -- 2024
      (1, 65000, 'зарплата', '2024-01-31'), (1, 65000, 'зарплата', '2024-02-29'), (1, 65000, 'зарплата', '2024-03-31'),
      (1, 65000, 'зарплата', '2024-04-30'), (1, 65000, 'зарплата', '2024-05-31'), (1, 65000, 'зарплата', '2024-06-30'),
      (1, 65000, 'зарплата', '2024-07-31'), (1, 65000, 'зарплата', '2024-08-31'), (1, 65000, 'зарплата', '2024-09-30'),
      (1, 65000, 'зарплата', '2024-10-31'), (1, 65000, 'зарплата', '2024-11-30'), (1, 65000, 'зарплата', '2024-12-31'),
      -- 2025
      (1, 65000, 'зарплата', '2025-01-31'), (1, 65000, 'зарплата', '2025-02-28'), (1, 65000, 'зарплата', '2025-03-31'),
      -- премия
      (1, 10000, 'премия', '2024-12-25');


-- Петр Петров: 70000 + 50000 за проект (в проекте участвует) + 5000 опыт = 125000
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
      -- 2023
      (2, 125000, 'зарплата', '2023-01-31'), (2, 125000, 'зарплата', '2023-02-28'), (2, 125000, 'зарплата', '2023-03-31'),
      (2, 125000, 'зарплата', '2023-04-30'), (2, 125000, 'зарплата', '2023-05-31'), (2, 125000, 'зарплата', '2023-06-30'),
      (2, 125000, 'зарплата', '2023-07-31'), (2, 125000, 'зарплата', '2023-08-31'), (2, 125000, 'зарплата', '2023-09-30'),
      (2, 125000, 'зарплата', '2023-10-31'), (2, 125000, 'зарплата', '2023-11-30'), (2, 125000, 'зарплата', '2023-12-31'),
      -- 2024
      (2, 125000, 'зарплата', '2024-01-31'), (2, 125000, 'зарплата', '2024-02-29'), (2, 125000, 'зарплата', '2024-03-31'),
      (2, 125000, 'зарплата', '2024-04-30'), (2, 125000, 'зарплата', '2024-05-31'), (2, 125000, 'зарплата', '2024-06-30'),
      (2, 125000, 'зарплата', '2024-07-31'), (2, 125000, 'зарплата', '2024-08-31'), (2, 125000, 'зарплата', '2024-09-30'),
      (2, 125000, 'зарплата', '2024-10-31'), (2, 125000, 'зарплата', '2024-11-30'), (2, 125000, 'зарплата', '2024-12-31'),
      -- 2025
      (2, 125000, 'зарплата', '2025-01-31'), (2, 125000, 'зарплата', '2025-02-28'), (2, 125000, 'зарплата', '2025-03-31'),
      -- премия
      (2, 15000, 'премия', '2024-09-01');

-- Сергей Сергеев: 60000 + 5000 = 65000
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
    (3, 65000, 'зарплата', '2023-01-31'),
    (3, 65000, 'зарплата', '2023-02-28'),
    (3, 65000, 'зарплата', '2023-03-31'),
    (3, 65000, 'зарплата', '2023-04-30'),
    (3, 65000, 'зарплата', '2023-05-31'),
    (3, 65000, 'зарплата', '2023-06-30'),
    (3, 65000, 'зарплата', '2023-07-31'),
    (3, 65000, 'зарплата', '2023-08-31'),
    (3, 65000, 'зарплата', '2023-09-30'),
    (3, 65000, 'зарплата', '2023-10-31'),
    (3, 65000, 'зарплата', '2023-11-30'),
    (3, 65000, 'зарплата', '2023-12-31'),
    (3, 65000, 'зарплата', '2024-01-31'),
    (3, 65000, 'зарплата', '2024-02-29'),
    (3, 65000, 'зарплата', '2024-03-31'),
    (3, 65000, 'зарплата', '2024-04-30'),
    (3, 65000, 'зарплата', '2024-05-31'),
    (3, 65000, 'зарплата', '2024-06-30'),
    (3, 65000, 'зарплата', '2024-07-31'),
    (3, 65000, 'зарплата', '2024-08-31'),
    (3, 65000, 'зарплата', '2024-09-30'),
    (3, 65000, 'зарплата', '2024-10-31'),
    (3, 65000, 'зарплата', '2024-11-30'),
    (3, 65000, 'зарплата', '2024-12-31'),
    (3, 65000, 'зарплата', '2025-01-31'),
    (3, 65000, 'зарплата', '2025-02-28'),
    (3, 65000, 'зарплата', '2025-03-31'),
    (3, 7000, 'премия', '2024-12-31');

-- Анна Смирнова: 50000 + 15000 (проект) = 65000
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
    (4, 65000, 'зарплата', '2023-01-31'),
    (4, 65000, 'зарплата', '2023-02-28'),
    (4, 65000, 'зарплата', '2023-03-31'),
    (4, 65000, 'зарплата', '2023-04-30'),
    (4, 65000, 'зарплата', '2023-05-31'),
    (4, 65000, 'зарплата', '2023-06-30'),
    (4, 65000, 'зарплата', '2023-07-31'),
    (4, 65000, 'зарплата', '2023-08-31'),
    (4, 65000, 'зарплата', '2023-09-30'),
    (4, 65000, 'зарплата', '2023-10-31'),
    (4, 65000, 'зарплата', '2023-11-30'),
    (4, 65000, 'зарплата', '2023-12-31'),
    (4, 65000, 'зарплата', '2024-01-31'),
    (4, 65000, 'зарплата', '2024-02-29'),
    (4, 65000, 'зарплата', '2024-03-31'),
    (4, 65000, 'зарплата', '2024-04-30'),
    (4, 65000, 'зарплата', '2024-05-31'),
    (4, 65000, 'зарплата', '2024-06-30'),
    (4, 65000, 'зарплата', '2024-07-31'),
    (4, 65000, 'зарплата', '2024-08-31'),
    (4, 65000, 'зарплата', '2024-09-30'),
    (4, 65000, 'зарплата', '2024-10-31'),
    (4, 65000, 'зарплата', '2024-11-30'),
    (4, 65000, 'зарплата', '2024-12-31'),
    (4, 65000, 'зарплата', '2025-01-31'),
    (4, 65000, 'зарплата', '2025-02-28'),
    (4, 65000, 'зарплата', '2025-03-31'),
    (4, 5000, 'премия', '2024-07-01');

-- Нелюбина: Разработчик 70000 + проект 20000 = 90000
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
    (6, 90000, 'зарплата', '2023-06-30'),
    (6, 90000, 'зарплата', '2023-07-31'),
    (6, 90000, 'зарплата', '2023-08-31'),
    (6, 90000, 'зарплата', '2023-09-30'),
    (6, 90000, 'зарплата', '2023-10-31'),
    (6, 90000, 'зарплата', '2023-11-30'),
    (6, 90000, 'зарплата', '2023-12-31'),
    (6, 90000, 'зарплата', '2024-01-31'),
    (6, 90000, 'зарплата', '2024-02-29'),
    (6, 90000, 'зарплата', '2024-03-31'),
    (6, 90000, 'зарплата', '2024-04-30'),
    (6, 90000, 'зарплата', '2024-05-31'),
    (6, 90000, 'зарплата', '2024-06-30'),
    (6, 90000, 'зарплата', '2024-07-31'),
    (6, 90000, 'зарплата', '2024-08-31'),
    (6, 90000, 'зарплата', '2024-09-30'),
    (6, 90000, 'зарплата', '2024-10-31'),
    (6, 90000, 'зарплата', '2024-11-30'),
    (6, 90000, 'зарплата', '2024-12-31'),
    (6, 90000, 'зарплата', '2025-01-31'),
    (6, 90000, 'зарплата', '2025-02-28'),
    (6, 90000, 'зарплата', '2025-03-31'),
    (6, 8000, 'премия', '2024-11-20');

-- Снигирева: Стажёр 20000
INSERT INTO payment_history (Employee_id, payment, payment_type, payment_date) VALUES
    (5, 20000, 'зарплата', '2024-07-31'),
    (5, 20000, 'зарплата', '2024-08-31'),
    (5, 20000, 'зарплата', '2024-09-30'),
    (5, 20000, 'зарплата', '2024-10-31'),
    (5, 20000, 'зарплата', '2024-11-30'),
    (5, 20000, 'зарплата', '2024-12-31'),
    (5, 20000, 'зарплата', '2025-01-31'),
    (5, 20000, 'зарплата', '2025-02-28'),
    (5, 20000, 'зарплата', '2025-03-31'),
    (5, 3000, 'премия', '2025-02-15');


INSERT INTO experience_payment (experience, payment) VALUES
    (5, 5000),
    (10, 15000);

INSERT INTO awards (awards_name, payment, description) VALUES
    ('Лучший сотрудник', 10000, 'Отличная работа за год'),
    ('Лучший новичок', 5000, 'Выдающиеся результаты за первые месяцы'),
    ('За вклад в проект', 7000, 'Значительный вклад в проект компании');

INSERT INTO authorization_table (user_id, login, password) VALUES
    (1, 'ivanov', '12345'),
    (4, 'Stacy', '0000');

INSERT INTO projects (projects_name, start_date, end_date, status) VALUES
    ('Проект Альфа', '2023-01-01', NULL, 'в процессе'),
    ('Проект Бета', '2018-01-01', '2019-12-31', 'закончен');

INSERT INTO roles (role_name) VALUES
    ('Руководитель'),
    ('Разработчик'),
    ('Аналитик'),
    ('Тестировщик');

INSERT INTO roles_of_employee (Employee_id, projects_id, role_id, start_date, end_date) VALUES
    -- Иван Иванов
    (1, 1, 1, '2020-04-02', '2023-12-31'), -- Руководитель в проекте Альфа
    (1, 2, 1, '2024-01-01', NULL),         -- Руководитель в проекте Бета

    -- Петр Петров
    (2, 1, 2, '2019-03-01', '2023-12-31'), -- Разработчик в проекте Альфа
    (2, 2, 2, '2024-01-01', NULL),         -- Разработчик в проекте Бета

    -- Сергей Сергеев
    (3, 1, 3, '2017-06-01', '2023-12-31'), -- Аналитик в проекте Альфа
    -- Анна Смирнова
    (4, 1, 4, '2023-01-01', NULL),         -- Тестировщик в проекте Альфа
    -- Анастасия Нелюбинаа
    (6, 2, 2, '2024-01-01', NULL);         -- Разработчик в проекте Бета


INSERT INTO projects_roles (projects_id, role_id, Employee_id, payment) VALUES
    (1, 1, 2, 30000),
    (1, 2, 2, 20000),
    (1, 2, 6, 20000),
    (1, 4, 4, 15000);